ficheros-configuracion/eshell.org
#+TITLE: Configuración de Eshell
#+AUTHOR: Maxxcan Fox
#+EMAIL: maxxcan@disroot.org

* Introducción

Eshell es el emulador de consola de texto que lleva incorporado Emacs. En Emacs podemos ejecutar cualquier shell, sea bash, zsh, tcs, etc, pero lo que hace a Eshell único es que además de las funciones propias de un emulador de consola como comandos unix, alias, etc, también puedes ejecutar ordenes escritas en elisp. 

Vamos a añadir un pequeño código para mejorar el aspecto y la usabilidad de Eshell


#+BEGIN_SRC emacs-lisp :tangle ~/.config/emacs/config/eshell.el :padline no :results silent
;;; eshell ;;;;;;;;;;;;;;,

(eval-after-load "em-ls"
    '(progn
       (defun ted-eshell-ls-find-file-at-point (point)
         "RET on Eshell's `ls' output to open files."
         (interactive "d")
         (find-file (buffer-substring-no-properties
                     (previous-single-property-change point 'help-echo)
                     (next-single-property-change point 'help-echo))))

       (defun pat-eshell-ls-find-file-at-mouse-click (event)
         "Middle click on Eshell's `ls' output to open files.
 From Patrick Anderson via the wiki."
         (interactive "e")
         (ted-eshell-ls-find-file-at-point (posn-point (event-end event))))

       (let ((map (make-sparse-keymap)))
         (define-key map (kbd "RET")      'ted-eshell-ls-find-file-at-point)
         (define-key map (kbd "<return>") 'ted-eshell-ls-find-file-at-point)
         (define-key map (kbd "<mouse-2>") 'pat-eshell-ls-find-file-at-mouse-click)
         (defvar ted-eshell-ls-keymap map))

       (defadvice eshell-ls-decorated-name (after ted-electrify-ls activate)
         "Eshell's `ls' now lets you click or RET on file names to open them."
         (add-text-properties 0 (length ad-return-value)
                              (list 'help-echo "RET, mouse-2: visit this file"
                                    'mouse-face 'highlight
                                    'keymap ted-eshell-ls-keymap)
                              ad-return-value)
         ad-return-value)))


(add-hook 'eshell-preoutput-filter-functions  'ansi-color-apply)
#+END_SRC
